strategies = [
  {
    "id": 1,
    "策略名稱": "兩隻烏鴉",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "第一天長紅，第二天高開收綠，第三天再次高開繼續收綠，收盤比前一日收盤價低。",
    "圖片名稱": "Two_Crows.png",
    "備註": "三日K線"
  },
  {
    "id": 2,
    "策略名稱": "三隻烏鴉",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "連續三根長綠，每日收盤價都下跌且接近最低價，每日開盤價都在上根K線實體內",
    "圖片名稱": "Three_Crows.png",
    "備註": "三日K線"
  },
  {
    "id": 3,
    "策略名稱": "三內部上漲",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "K線為綠紅紅，第三天收盤價高於第一天開盤價，第二天K線在第一天K線內部。",
    "圖片名稱": "Three_Inside_Up_Bullish.png.png",
    "備註": "三日K線"
  },
  {
    "id": 4,
    "策略名稱": "三內部下跌",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "K線為紅綠綠，第三天收盤價低於第一天開盤價，第二天K線在第一天K線內部。",
    "圖片名稱": "Three_Inside_Down_Bearish.png",
    "備註": "三日K線"
  },
  {
    "id": 5,
    "策略名稱": "三線震盪(熊)",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "前三根紅K，每日收盤價都比前一日高，開盤價在前一日實體內，第四日市場高開，收盤價低於第一日開盤價，預示股價下跌。",
    "圖片名稱": "Three_Line_Strike_Bearish.png",
    "備註": "四日K線"
  },
  {
    "id": 6,
    "策略名稱": "三線震盪(牛)",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "前三根綠K，每日收盤價都比前一日低，開盤價在前一日實體內，第四日市場高低，收盤價高於第一日開盤價，預示股價上漲。",
    "圖片名稱": "Three_Line_Strike_Bullish.png",
    "備註": "四日K線"
  },
  {
    "id": 7,
    "策略名稱": "三外部上漲",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "K線為綠紅紅，但第一日與第二日的K線形態相反，第一日K線在第二日K線內部，預示著股價上漲",
    "圖片名稱": "Three_Outside_Up_Bullish.png.png",
    "備註": "三日K線"
  },
  {
    "id": 8,
    "策略名稱": "三內部下跌",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "K線為紅綠綠，但第一日與第二日的K線形態相反，第一日K線在第二日K線內部，預示著股價下跌",
    "圖片名稱": "Three_Outside_Down_Bearish.png",
    "備註": "三日K線"
  },
  {
    "id": 9,
    "策略名稱": "南方三星",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "三日K線皆綠，第一日有長下影線，第二日與第一日類似，K線整體小於第一日，第三日無下影線實體信號，成交價格都在第一日振幅之內，預示下跌趨勢反轉，股價上升",
    "圖片名稱": "Three_White_Soliders.png",
    "備註": "三日K線"
  },
  {
    "id": 10,
    "策略名稱": "三白兵",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "三日K線皆紅，每日收盤價變高且接近最高價，開盤價在前一日實體上半部，預示股價上升",
    "圖片名稱": "Three_Stars_In_The_South.png",
    "備註": "三日K線"
  },
  {
    "id": 11,
    "策略名稱": "棄嬰(熊)",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "第一天是一根堅挺的紅K，第二天是向上跳空十字線，第三天是一根向下跳空的疲軟綠K且收盤價位於第一天蠟燭線的實體內。",
    "圖片名稱": "Abandoned_Baby_Bearish.png",
    "備註": "三日K線"
  },
  {
    "id": 12,
    "策略名稱": "棄嬰(牛)",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "第一天是一根疲軟綠K，第二天是向上跳空十字線，第三天是一根向上跳空的堅挺的紅K且收盤價涵蓋第一天蠟燭線的實體。",
    "圖片名稱": "Abandoned_Baby_Bullish.png",
    "備註": "三日K線"
  },
  {
    "id": 13,
    "策略名稱": "大敵當前/推進",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "三日都收紅，每日收盤價都比前一日高，開盤價都在前一日實體以內，實體變短，上影線變長。",
    "圖片名稱": "Advance_Block.png",
    "備註": "三日K線"
  },
  {
    "id": 14,
    "策略名稱": "執帶(熊)",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "第一日紅K，第二日開盤價為最高價的綠K且收盤價接近最低價",
    "圖片名稱": "Belt_Hold_Bearish.png",
    "備註": "兩日K線"
  },
  {
    "id": 15,
    "策略名稱": "執帶(牛)",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "第一日綠K，第二日開盤價為最低價的紅K且收盤價接近最高價",
    "圖片名稱": "Belt_Hold_Bullish.png",
    "備註": "兩日K線"
  },
  {
    "id": 16,
    "策略名稱": "脫離(牛)",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "下跌趨勢中，第一日長綠K，第二日跳空綠K，延續趨勢開始震盪，第五日長紅K，收盤價在第一天收盤價與第二天開盤價之間，預示價格上漲。",
    "圖片名稱": "Break_Away_Bullish.png",
    "備註": "五日K線"
  },
  {
    "id": 17,
    "策略名稱": "脫離(熊)",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "上漲趨勢中，第一日長紅K，第二日跳空紅K，延續趨勢開始震盪，第五日長綠K，收盤價在第一天收盤價與第二天開盤價之間，預示價格下跌。",
    "圖片名稱": "Break_Away_Bearish.png",
    "備註": "五日K線"
  },
  {
    "id": 18,
    "策略名稱": "捉腰帶線(牛)",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "最低價低於開盤價，收盤價等於最高價，預示著趨勢持續。",
    "圖片名稱": "Closing_Marubozu_Bullish.png",
    "備註": "兩日K線"
  },
  {
    "id": 19,
    "策略名稱": "捉腰帶線(熊)",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "最高價高於開盤價，收盤價等於最低價，預示著趨勢持續。",
    "圖片名稱": "Closing_Marubozu_Bearish.png",
    "備註": "兩日K線"
  },
  {
    "id": 20,
    "策略名稱": "藏嬰吞沒",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "下跌趨勢中，前兩日綠K無影線，第二日開盤、收盤價皆低於第二日，第三日倒鎚頭，第四日開盤價高於前一日最高價，收盤價低於前一日最低價，預示著底部反轉。",
    "圖片名稱": "Concealing_Baby_Swallow.png",
    "備註": "四日K線"
  },
  {
    "id": 21,
    "策略名稱": "反擊線(牛)",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "後一個紅K僅回升超過前一綠K天的收盤價位置。",
    "圖片名稱": "Counter_Attack_Bullish.png",
    "備註": "兩日K線"
  },
  {
    "id": 22,
    "策略名稱": "反擊線(熊)",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "後一個綠K僅下跌超過前一天紅K的收盤價位置。",
    "圖片名稱": "Counter_Attack_Bearish.png",
    "備註": "兩日K線"
  },
  {
    "id": 23,
    "策略名稱": "烏雲蓋頂",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "第一天是一根堅挺的紅K，第二天開盤價超過了第一天的最高價，但收盤價位於第一天的K棒實體中。",
    "圖片名稱": "Dark_CloudCover.png",
    "備註": "兩日K線"
  },
  {
    "id": 24,
    "策略名稱": "CCI 正穿越",
    "種類": "index value",
    "訊號別": "buy",
    "描述": "CCI值由下向上穿越+100或-100",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 25,
    "策略名稱": "CCI 負穿越",
    "種類": "index value",
    "訊號別": "sell",
    "描述": "CCI值由上向下穿越-100或+100",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 26,
    "策略名稱": "MACD柱線(hist)多頭",
    "種類": "index value",
    "訊號別": "buy",
    "描述": "柱線由負轉正",
    "圖片名稱": "",
    "備註": "talib macd 範例"
  },
  {
    "id": 27,
    "策略名稱": "MACD柱線(hist)空頭",
    "種類": "index value",
    "訊號別": "sell",
    "描述": "柱線由正轉負",
    "圖片名稱": "",
    "備註": "https://reurl.cc/y7yQE6"
  },
  {
    "id": 28,
    "策略名稱": "RSI 黃金交叉",
    "種類": "index trend",
    "訊號別": "buy",
    "描述": "「6天的 RSI 」向上突破「20天的 RSI 」",
    "圖片名稱": "",
    "備註": "talib rsi 範例"
  },
  {
    "id": 29,
    "策略名稱": "RSI 死亡交叉",
    "種類": "index trend",
    "訊號別": "sell",
    "描述": "「6天的 RSI 」向下跌破「20天的 RSI 」",
    "圖片名稱": "",
    "備註": "https://reurl.cc/65gEak"
  },
  {
    "id": 30,
    "策略名稱": "RSI 超賣",
    "種類": "index value",
    "訊號別": "buy",
    "描述": "RSI < 20",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 31,
    "策略名稱": "RSI 超買",
    "種類": "index value",
    "訊號別": "sell",
    "描述": "RSI > 80",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 32,
    "策略名稱": "KD 超賣",
    "種類": "index value",
    "訊號別": "buy",
    "描述": "20下方",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 33,
    "策略名稱": "KD 超買",
    "種類": "index value",
    "訊號別": "sell",
    "描述": "80以上",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 34,
    "策略名稱": "KD黃金交叉",
    "種類": "index trend",
    "訊號別": "buy",
    "描述": "K線從下向上突破D線",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 35,
    "策略名稱": "KD死亡交叉",
    "種類": "index trend",
    "訊號別": "sell",
    "描述": "K線從上向下突破D線",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 36,
    "策略名稱": "KD 高檔背離",
    "種類": "index value",
    "訊號別": "sell",
    "描述": "市場價格創出新高，KD指標卻沒有創出新高",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 37,
    "策略名稱": "KD 低檔背離",
    "種類": "index value",
    "訊號別": "buy",
    "描述": "市場價格創出新低，KD指標卻沒有創出新低",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 38,
    "策略名稱": "WR 超賣",
    "種類": "index value",
    "訊號別": "buy",
    "描述": "負80到 負100",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 39,
    "策略名稱": "WR 超買",
    "種類": "index value",
    "訊號別": "sell",
    "描述": "0 到 負20 範圍",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 40,
    "策略名稱": "WR 高檔背離",
    "種類": "index value",
    "訊號別": "sell",
    "描述": "市場價格創出新高，威廉指標卻沒有創出新高",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 41,
    "策略名稱": "WR 低檔背離",
    "種類": "index value",
    "訊號別": "buy",
    "描述": "市場價格創出新低，威廉指標卻沒有創出新低",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 42,
    "策略名稱": "Bias 6日超買",
    "種類": "index value",
    "訊號別": "sell",
    "描述": "大於3.5%",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 43,
    "策略名稱": "Bias 6日超賣",
    "種類": "index value",
    "訊號別": "buy",
    "描述": "小於-3%",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 44,
    "策略名稱": "Bias 12日超買",
    "種類": "index value",
    "訊號別": "sell",
    "描述": "大於＋5%",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 45,
    "策略名稱": "Bias 12日超賣",
    "種類": "index value",
    "訊號別": "buy",
    "描述": "小於-4.5%",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 46,
    "策略名稱": "Bias 24日超買",
    "種類": "index value",
    "訊號別": "sell",
    "描述": "大於8%",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 47,
    "策略名稱": "Bias 24日超賣",
    "種類": "index value",
    "訊號別": "buy",
    "描述": "小於-7%",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 48,
    "策略名稱": "Bias 72日超買",
    "種類": "index value",
    "訊號別": "sell",
    "描述": "大於＋11%",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 49,
    "策略名稱": "Bias 72日超賣",
    "種類": "index value",
    "訊號別": "buy",
    "描述": "小於-11%",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 50,
    "策略名稱": "蜻蜓十字/T形十字",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "開盤後價格一路走低，之後收復，收盤價與開盤價相同，預示趨勢反轉",
    "圖片名稱": "Dragonfly_Doji.png",
    "備註": "一日K線"
  },
  {
    "id": 51,
    "策略名稱": "多頭吞沒模式",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "多頭吞噬，第一日為綠線，第二日紅線，第一日的開盤價和收盤價在第二日開盤價收盤價之內，但不能完全相同。",
    "圖片名稱": "Engulfing_Pattern_Bullish.png",
    "備註": "兩日K線"
  },
  {
    "id": 52,
    "策略名稱": "空頭吞沒模式",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "空頭吞噬，第一日為紅線，第二日綠線，第一日的開盤價和收盤價在第二日開盤價收盤價之內，但不能完全相同。",
    "圖片名稱": "Engulfing_Pattern_Bearish.png",
    "備註": "兩日K線"
  },
  {
    "id": 53,
    "策略名稱": "黃昏十字星",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "基本模式為暮星，第二日收盤價和開盤價相同，預示頂部反轉。",
    "圖片名稱": "Evening_Doji_Star.png",
    "備註": "三日K線"
  },
  {
    "id": 54,
    "策略名稱": "黃昏之星",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "與晨星相反，上升趨勢中，第一日紅線，第二日價格振幅較小，第三日綠線，預示頂部反轉。",
    "圖片名稱": "Evening_Star.png",
    "備註": "三日K線"
  },
  {
    "id": 55,
    "策略名稱": "向上跳空並列紅線",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "上升趨勢向上跳空，第一日與第二日有相同開盤價，實體長度差不多，則趨勢持續。",
    "圖片名稱": "Up_gap_White_Lines.png",
    "備註": "二日K線"
  },
  {
    "id": 56,
    "策略名稱": "向下跳空並列綠線",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "下跌趨勢向下跳空，第一日與第二日有相同開盤價，實體長度差不多，則趨勢持續。",
    "圖片名稱": "Down_gap_White_Lines.png",
    "備註": "二日K線"
  },
  {
    "id": 57,
    "策略名稱": "墓碑十字/倒T十字",
    "種類": "candlestick pattern",
    "訊號別": "non",
    "描述": "開盤價與收盤價相同，上影線長，無下影線，預示底部反轉。",
    "圖片名稱": "Gravestone_Doji.png",
    "備註": "一日K線"
  },
  {
    "id": 58,
    "策略名稱": "鎚頭",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "實體較短，無上影線，下影線大於實體長度兩倍，處於下跌趨勢底部，預示反轉。",
    "圖片名稱": "Hammer.png",
    "備註": "一日K線"
  },
  {
    "id": 59,
    "策略名稱": "上吊線",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "形狀與錘子類似，處於上升趨勢的頂部，預示著趨勢反轉。",
    "圖片名稱": "Hanging_Man.png",
    "備註": "一日K線"
  },
  {
    "id": 60,
    "策略名稱": "多頭母子線",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "多頭母子，在下跌趨勢中，第一日K線長綠，第二日開盤價收盤價在第一日價格振幅之內，為紅線，預示趨勢反轉，股價上升。",
    "圖片名稱": "Harami_Pattern_Bullish.png",
    "備註": "二日K線"
  },
  {
    "id": 61,
    "策略名稱": "空頭母子線",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "空頭母子，在上漲趨勢中，第一日K線長紅，第二日開盤價收盤價在第一日價格振幅之內，為綠線，預示趨勢反轉，股價下跌。",
    "圖片名稱": "Harami_Pattern_Bearish.png",
    "備註": "二日K線"
  },
  {
    "id": 62,
    "策略名稱": "看漲十字孕線",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "與多頭母子線類似，若第二日K線是十字線，便稱為十字孕線，預示著趨勢反轉。",
    "圖片名稱": "Harami_Cross_Pattern_Bullish.png",
    "備註": "二日K線"
  },
  {
    "id": 63,
    "策略名稱": "看跌十字孕線",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "與空頭母子線類似，若第二日K線是十字線，便稱為十字孕線，預示著趨勢反轉。",
    "圖片名稱": "Harami_Cross_Pattern_Bearish.png",
    "備註": "二日K線"
  },
  {
    "id": 64,
    "策略名稱": "風高浪大線/長腳十字線",
    "種類": "candlestick pattern",
    "訊號別": "non",
    "描述": "具有極長的上/下影線與短的實體，預示著趨勢反轉。",
    "圖片名稱": "High_Wave_Candle.png",
    "備註": "三日K線"
  },
  {
    "id": 65,
    "策略名稱": "多頭陷阱",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "與多頭母子類似，第二日價格在前一日實體範圍內，第三日收盤價高於前兩日，反轉失敗，趨勢繼續。",
    "圖片名稱": "Hikkake_Pattern_Bullish.png",
    "備註": "三日K線"
  },
  {
    "id": 66,
    "策略名稱": "空頭陷阱",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "與空頭母子類似，第二日價格在前一日實體範圍內，第三日收盤價高於前兩日，反轉失敗，趨勢繼續。",
    "圖片名稱": "Hikkake_Pattern_Bearish.png",
    "備註": "三日K線"
  },
  {
    "id": 67,
    "策略名稱": "改良的多頭陷阱",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "與陷阱類似，上升趨勢中，第三日跳空高開；下跌趨勢中，第三日跳空低開，反轉失敗，趨勢繼續。",
    "圖片名稱": "Modified_Hikkake_Pattern_Bullish.png",
    "備註": "三日K線"
  },
  {
    "id": 68,
    "策略名稱": "改良的空頭陷阱",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "與陷阱類似，上升趨勢中，第三日跳空高開；下跌趨勢中，第三日跳空低開，反轉失敗，趨勢繼續。",
    "圖片名稱": "Modified_Hikkake_Pattern_Bearish.png",
    "備註": "三日K線"
  },
  {
    "id": 69,
    "策略名稱": "AR 150以上",
    "種類": "index value",
    "訊號別": "sell",
    "描述": "AR 50以下，表示進入超賣區，可買進股票 AR＝SUM(HIGH-OPEN,N)/SUM(OPEN-LOW,N)*100",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 70,
    "策略名稱": "AR 50以下",
    "種類": "index value",
    "訊號別": "buy",
    "描述": "AR 150以上則進入超買區，則請注意回檔或下跌，為賣出時機  AR＝SUM(HIGH-OPEN,N)/SUM(OPEN-LOW,N)*100",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 71,
    "策略名稱": "正DI線向上穿越負DI線",
    "種類": "index trend",
    "訊號別": "buy",
    "描述": "當+DI線向上穿越-DI線時，是買進的交易信號",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 72,
    "策略名稱": "正DI線向下穿越負DI線",
    "種類": "index trend",
    "訊號別": "sell",
    "描述": "當+DI線向下穿越-DI線時，是賣出的交易信號",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 73,
    "策略名稱": "VR上升但股價未動",
    "種類": "index trend",
    "訊號別": "buy",
    "描述": "當VR開始上升但股價未動時，即呈現背離，此時是買進訊號",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 74,
    "策略名稱": "VR超過160%-450%",
    "種類": "index value",
    "訊號別": "sell",
    "描述": "當VR超過160%-450%時，很可能會出現多頭後繼無力的情況，應伺機賣出",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 75,
    "策略名稱": "VR在40~70%",
    "種類": "index value",
    "訊號別": "buy",
    "描述": "低價區域:70~40為可買進區域",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 76,
    "策略名稱": "BR300以上",
    "種類": "index value",
    "訊號別": "sell",
    "描述": "BR300以上為超買區，股價可能隨時回檔，為賣出時機",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 77,
    "策略名稱": "BR50以下",
    "種類": "index value",
    "訊號別": "buy",
    "描述": "BR50以下為超賣區，股價可能隨時反彈，為買進時機",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 78,
    "策略名稱": "ARBR應用",
    "種類": "index trend",
    "訊號別": "sell",
    "描述": "當AR及BR急速下降時，表示股價已近高峰，應獲利了結",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 79,
    "策略名稱": "ARBR應用",
    "種類": "index trend",
    "訊號別": "sell",
    "描述": "當BR急速上升，但AR小跌或盤整時，應逢高出貨",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 80,
    "策略名稱": "ARBR應用",
    "種類": "index trend",
    "訊號別": "buy",
    "描述": "當BR比AR低時，可逢低買進",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 81,
    "策略名稱": "AD同步上漲",
    "種類": "index trend",
    "訊號別": "buy",
    "描述": "當AD指標與股價走勢變化同步上漲時，代表行情有機率能夠持續上漲",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 82,
    "策略名稱": "AD同步下降",
    "種類": "index trend",
    "訊號別": "sell",
    "描述": "當AD指標與股價走勢變化同步下降時，代表行情有機率能夠持續下跌",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 83,
    "策略名稱": "AD看漲背離",
    "種類": "index trend",
    "訊號別": "buy",
    "描述": "當股市價格下跌，但AD指標卻呈現上漲趨勢，即是稱為看漲背離。雖然當下是處於下跌，但可以預期行情及香反轉變動往上漲。",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 84,
    "策略名稱": "AD看跌背離",
    "種類": "index trend",
    "訊號別": "sell",
    "描述": "當股市價格上漲，但AD指標卻呈現下跌趨勢，即是稱為看跌背離。雖然當下是處於上漲，但可以預期行情及香反轉變動往下跌。",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 85,
    "策略名稱": "ATR停損",
    "種類": "stop loss",
    "訊號別": "sell",
    "描述": "止損設置成某個價格點位下方的1倍或0.5倍ATR",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 86,
    "策略名稱": "家鴿",
    "種類": "candlestick pattern",
    "訊號別": "non",
    "描述": "與母子線類似，二日K線顏色相同，第二日最高價、最低價都在第一日實體之内。",
    "圖片名稱": "Homing_Pigeon_Bullish.png",
    "備註": "二日K線"
  },
  {
    "id": 87,
    "策略名稱": "三胞胎烏鴉",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "上漲趨勢中，三日都為綠線，長度大致相等，每日開盤價等於前一日收盤價，收盤價接近當日最低價，預示價格下跌。",
    "圖片名稱": "Identical_Three_Crows_Bearish.png",
    "備註": "三日K線"
  },
  {
    "id": 88,
    "策略名稱": "頸內線",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "下跌趨勢中，第一日長綠線，第二日開盤價較低，收盤價略高於第一日收盤價，紅線，實體較短。",
    "圖片名稱": "In_Neck _Pattern_Bearish.png",
    "備註": "二日K線"
  },
  {
    "id": 89,
    "策略名稱": "倒錘頭",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "上影線較長，長度為實體2倍以上，無下影線，在下跌趨勢底部，預示著趨勢反轉。",
    "圖片名稱": "Inverted_Hammer_Bullish.png",
    "備註": "一日K線"
  },
  {
    "id": 90,
    "策略名稱": "反沖型態",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "與分離線類似，兩日K線為禿線，顏色相反，存在跳空缺口。",
    "圖片名稱": "Kicking_Bullish.png",
    "備註": "二日K線"
  },
  {
    "id": 91,
    "策略名稱": "反沖型態",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "與分離線類似，兩日K線為禿線，顏色相反，存在跳空缺口。",
    "圖片名稱": "Kicking_Bearish.png",
    "備註": "二日K線"
  },
  {
    "id": 92,
    "策略名稱": "反沖型態（由較長缺影線決定的反沖型態)",
    "種類": "candlestick pattern",
    "訊號別": "non",
    "描述": "與反沖型態類似，較長缺影線決定價格的漲跌。",
    "圖片名稱": "Kicking_bullbear_determined_by_the_longer_marubozu_Block.png",
    "備註": "二日K線"
  },
  {
    "id": 93,
    "策略名稱": "梯底",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "下跌趨勢中，前三日綠線，開盤價與收盤價皆低於前一日開盤、收盤價，第四日倒錘頭，第五日開盤價高於前一日開盤價，紅線，收盤價高於前幾日價格振幅。",
    "圖片名稱": "Ladder_Bottom_Bullish.png",
    "備註": "五日K線"
  },
  {
    "id": 94,
    "策略名稱": "長腳十字",
    "種類": "candlestick pattern",
    "訊號別": "non",
    "描述": "開盤價與收盤價相同居當日價格中部，上下影線長，表達市場不確定性。",
    "圖片名稱": "Long_Legged_Doji_Bullish.png",
    "備註": "一日K線"
  },
  {
    "id": 95,
    "策略名稱": "長蠟燭線",
    "種類": "candlestick pattern",
    "訊號別": "non",
    "描述": "K線實體長，無上下影線。",
    "圖片名稱": "Long_Line_Candle_Block.png",
    "備註": "一日K線"
  },
  {
    "id": 96,
    "策略名稱": "光頭光腳/缺影線(熊)",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "上下兩頭都沒有影線的實體，綠線預示著熊市持續或者牛市反轉，紅線相反。",
    "圖片名稱": "Marubozu_Bearish.png",
    "備註": "一日K線"
  },
  {
    "id": 97,
    "策略名稱": "光頭光腳/缺影線(牛)",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "上下兩頭都沒有影線的實體，紅線預示著熊市持續或者牛市反轉，綠線相反。",
    "圖片名稱": "Marubozu_Bullish.png",
    "備註": "一日K線"
  },
  {
    "id": 98,
    "策略名稱": "相同低價/匹配低價",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "下跌趨勢中，第一日長綠K線，第二日綠K線，收盤價與前一日相同，預示底部確認，該價格為支撐位。",
    "圖片名稱": "Matching_Low_Bullish.png",
    "備註": "二日K線"
  },
  {
    "id": 99,
    "策略名稱": "鋪墊",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "第一日紅K線，第二日跳空高開影線，第三、四日短實體影線，第五日紅K線，收盤價高於前四日，預示趨勢持續。",
    "圖片名稱": "Mat_Hold_Bullish.png",
    "備註": "五日K線"
  },
  {
    "id": 100,
    "策略名稱": "十字晨星/早晨十字星",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "基本模式為晨星，第二日K線為十字星，預示底部反轉。。",
    "圖片名稱": "Morning_Doji_Star_Bullish.png",
    "備註": "三日K線"
  },
  {
    "id": 101,
    "策略名稱": "晨星",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "下跌趨勢，第一日綠K線，第二日價格振幅較小，第三天紅K線，預示底部反轉。",
    "圖片名稱": "Morning_Star_Bullish.png",
    "備註": "三日K線"
  },
  {
    "id": 102,
    "策略名稱": "頸上線",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "下跌趨勢中，第一日長綠K線，第二日開盤價較低，收盤價與前一日最低價相同，紅線，實體較短，預示著延續下跌趨勢",
    "圖片名稱": "On_Neck_Pattern_Bearish.png",
    "備註": "兩日K線"
  },
  {
    "id": 103,
    "策略名稱": "刺透型態",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "下跌趨勢中，第一日綠K線，第二日收盤價低於前一日最低價，收盤價處在第一日實體上部，預示著底部反轉。",
    "圖片名稱": "Piercing Pattern.png",
    "備註": "兩日K線"
  },
  {
    "id": 104,
    "策略名稱": "黃包車夫線",
    "種類": "candlestick pattern",
    "訊號別": "non",
    "描述": "與長腿十字線類似，若實體正好處於價格振幅中點，稱為黃包車夫。",
    "圖片名稱": "Rickshaw Man.png",
    "備註": "一日K線"
  },
  {
    "id": 105,
    "策略名稱": "上升三法",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "上漲趨勢中，第一日長紅K線，中間三日價格在第一日範圍內小幅震盪，第五日長紅K線，收盤價高於第一日收盤價，預示股價上升。",
    "圖片名稱": "Rising Three Methods.png",
    "備註": "五日K線"
  },
  {
    "id": 106,
    "策略名稱": "下降三法",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "下跌趨勢中，第一日長綠K線，中間三日價格在第一日範圍內小幅震盪，第五日長綠K線，收盤價低於第一日收盤價，預示股價下跌。",
    "圖片名稱": "Falling Three Methods.png",
    "備註": "五日K線"
  },
  {
    "id": 107,
    "策略名稱": "上升分離/分割線",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "上漲趨勢中，第一日綠K線，第二日紅K線，第二日開盤價與第一日相同且為最低價，預示著趨勢繼續。",
    "圖片名稱": "Rising Separating Lines.png",
    "備註": "兩日K線"
  },
  {
    "id": 108,
    "策略名稱": "下降分離/分割線",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "下跌趨勢中，第一日紅K線，第二日綠K線，第二日開盤價與第一日相同且為最高價，預示著趨勢繼續。",
    "圖片名稱": "Falling Separating Lines.png",
    "備註": "兩日K線"
  },
  {
    "id": 109,
    "策略名稱": "射擊之星/流星線",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "上影線至少為實體長度兩倍，沒有下影線，預示著股價下跌",
    "圖片名稱": "Shooting Star.png",
    "備註": "一日K線"
  },
  {
    "id": 110,
    "策略名稱": "短蠟燭線",
    "種類": "candlestick pattern",
    "訊號別": "non",
    "描述": "具有較短實體和上下影線的一根蠟燭線。此型態並不表示任何看漲或者看跌。",
    "圖片名稱": "Short Line Candle.png",
    "備註": "一日K線"
  },
  {
    "id": 111,
    "策略名稱": "紡錘線",
    "種類": "candlestick pattern",
    "訊號別": "non",
    "描述": "實體小。",
    "圖片名稱": "Spinning Top.png",
    "備註": "一日K線"
  },
  {
    "id": 112,
    "策略名稱": "停頓形態",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "上漲趨勢中，第二日長紅K線，第三日開盤於前一日收盤價附近，短紅K線，預示著上漲結束。",
    "圖片名稱": "Stalled Pattern.png",
    "備註": "三日K線"
  },
  {
    "id": 113,
    "策略名稱": "條形三明治",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "第一日長綠K線，第二日紅K線，開盤價高於前一日收盤價，第三日開盤價高於前兩日最高價，收盤價於第一日收盤價相同。",
    "圖片名稱": "Stick Sandwich.png",
    "備註": "三日K線"
  },
  {
    "id": 114,
    "策略名稱": "探水竿",
    "種類": "candlestick pattern",
    "訊號別": "non",
    "描述": "大致與蜻蜓十字相同，下影線長度長。",
    "圖片名稱": "Takuri.png",
    "備註": "一日K線"
  },
  {
    "id": 115,
    "策略名稱": "跳空並列紅線",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "前兩日紅K線，第二日跳空，第三日綠K線，收盤價於缺口中，上升趨勢持續。",
    "圖片名稱": "Upside Tasuki Gap.png",
    "備註": "三日K線"
  },
  {
    "id": 116,
    "策略名稱": "跳空並列綠線",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "前兩日綠K線，第二日跳空，第三日紅K線，收盤價於缺口中，下跌趨勢持續。",
    "圖片名稱": "Downside Tasuki Gap.png",
    "備註": "三日K線"
  },
  {
    "id": 117,
    "策略名稱": "插入形態",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "與頸上線類似，下跌趨勢中，第一日長綠K線，第二日開盤價跳空，收盤價略低於前一日實體中部，與頸上線相比實體較長，預示著趨勢持續。",
    "圖片名稱": "Thrusting Pattern.png",
    "備註": "兩日K線"
  },
  {
    "id": 118,
    "策略名稱": "三星形態",
    "種類": "candlestick pattern",
    "訊號別": "non",
    "描述": "由三個十字組成，第二日十字必須高於或者低於第一日和第三日，預示著反轉。",
    "圖片名稱": "Tristar Pattern.png",
    "備註": "三日K線"
  },
  {
    "id": 119,
    "策略名稱": "獨特三河",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "下跌趨勢中，第一日長綠K線，第二日為鎚頭，最低價創新低，第三日開盤價低於第二日收盤價，收紅K線，收盤價不高於第二日收盤價，預示著反轉，第二日下影線越長可能性越大。",
    "圖片名稱": "Unique Three River.png",
    "備註": "三日K線"
  },
  {
    "id": 120,
    "策略名稱": "向上跳空的兩隻烏鴉/雙飛烏鴉",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "第一日紅K線，第二日跳空以高於第一日最高價開盤，收綠K線，第三日開盤價高於第二日，收綠K線，與第一日比仍有缺口。",
    "圖片名稱": "Upside Gap Two Crows.png",
    "備註": "三日K線"
  },
  {
    "id": 121,
    "策略名稱": "上升跳空三法",
    "種類": "candlestick pattern",
    "訊號別": "buy",
    "描述": "上漲趨勢中，第一日長紅K線，第二日短紅K線，第三日跳空紅K線，第四日綠K線，開盤價與收盤價於前兩日實體內，第五日長紅K線，收盤價高於第一日收盤價，預示股價上升。",
    "圖片名稱": "Upside Gap Three Methods.png",
    "備註": "五日K線"
  },
  {
    "id": 122,
    "策略名稱": "下降跳空三法",
    "種類": "candlestick pattern",
    "訊號別": "sell",
    "描述": "下跌趨勢中，第一日長綠K線，第二日短綠K線，第三日跳空綠K線，第四日紅K線，開盤價與收盤價於前兩日實體內，第五日長綠K線，收盤價高於第一日收盤價，預示股價下跌。",
    "圖片名稱": "Downside Gap Three Methods.png",
    "備註": "五日K線"
  },
  {
    "id": 123,
    "策略名稱": "ROC於極低位置",
    "種類": "index trend",
    "訊號別": "buy",
    "描述": "ROC下降到極低位置時，指標達到超賣水平，產生買入信號。",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 124,
    "策略名稱": "ROC於極高位置",
    "種類": "index trend",
    "訊號別": "sell",
    "描述": "ROC上升到極高位置時，指標達到超買水平，產生賣出信號。",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 125,
    "策略名稱": "MFI買入",
    "種類": "index value",
    "訊號別": "buy",
    "描述": "MFI低於 20",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 126,
    "策略名稱": "MFI賣出",
    "種類": "index value",
    "訊號別": "sell",
    "描述": "MFI高於 80",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 127,
    "策略名稱": "MFI與股價反向背離買入",
    "種類": "index trend",
    "訊號別": "buy",
    "描述": "當股價和 MFI 反向背離時，股價出現新低點，而 MFI 出現較高點，可以視為買入訊號。",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 128,
    "策略名稱": "MFI與股價反向背離賣出",
    "種類": "index trend",
    "訊號別": "sell",
    "描述": "當股價和 MFI 反向背離時，股價出現新高點，而 MFI 出現較低點，可以視為賣出訊號。",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 129,
    "策略名稱": "OBP",
    "種類": "index trend",
    "訊號別": "non",
    "描述": "整日對比股價上升日的交易量累計 - 整日對比股價下跌的交易量累計。",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 130,
    "策略名稱": "PVI向上穿越均線",
    "種類": "index trend",
    "訊號別": "buy",
    "描述": "PVI指標由下往上穿越其200天移動平均線，代表買進訊號。",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 131,
    "策略名稱": "PVI向下穿越均線",
    "種類": "index trend",
    "訊號別": "sell",
    "描述": "PVI指標由上往下穿越其200天移動平均線時，代表賣出訊號。",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 132,
    "策略名稱": "NVI向上穿越均線",
    "種類": "index trend",
    "訊號別": "buy",
    "描述": "NVI指標由下往上穿越其200天移動平均線，代表買進訊號。",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 133,
    "策略名稱": "NVI向下穿越均線",
    "種類": "index trend",
    "訊號別": "sell",
    "描述": "NVI指標由上往下穿越其200天移動平均線時，代表賣出訊號。",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 134,
    "策略名稱": "MTM與均值線在中心線上方",
    "種類": "index trend",
    "訊號別": "buy",
    "描述": "當動量值曲線和均值曲線都在中心線（0水平）上方時，如果動量值高於均值，此次為買入信號。",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 135,
    "策略名稱": "MTM與均值線在中心線下方",
    "種類": "index trend",
    "訊號別": "sell",
    "描述": "當動量值曲線和均值線都在中心線（0水平）下方時，如果動量值低於均值，此次為賣出信號。",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 136,
    "策略名稱": "MTM向下穿越中心線",
    "種類": "index trend",
    "訊號別": "sell",
    "描述": "MTM曲線由上向下跌破中心線（0水平）時，指示價格走勢進入下行趨勢，為賣出時機。",
    "圖片名稱": "",
    "備註": ""
  },
  {
    "id": 137,
    "策略名稱": "MTM向上穿越中心線",
    "種類": "index trend",
    "訊號別": "buy",
    "描述": "MTM曲線由下向上突破中心線（0水平）時，指示價格進入上行趨勢，為買進時機。",
    "圖片名稱": "",
    "備註": ""
  }
]

for strategy in strategies:
    if strategy['圖片名稱'] == '':
        strategy['圖片名稱'] = 'question-mark.jpg'
    if strategy['備註'] == '':
        strategy['備註'] = '備註備註備註'
    if strategy['描述'] == '':
        strategy['描述'] = '描述描述描述'
    # for key, value in strategy.items():
    #     print(value)
    # print('-'*40)